app/controllers/application_controller.rb

def params_variable
  @activation = '11499-65226-26429-87211'
  @abouts = About.all
  @aboutimages = Aboutimage.all
  @aboutimages.each do |image|
    @aboutimage = image.image

  end
  @typesofrent = Typesofrent.all
  @types = Type.all
  @logos = Logo.all
---
SELECT "abouts".* FROM "abouts"
SELECT "aboutimages".* FROM "aboutimages"
SELECT "logos".* FROM "logos"