app/controllers/purchases_controller.rb

SELECT "nophotos".* FROM "nophotos"
---
  def show
    @nophoto = Nophoto.all

    @nophoto.each do |nophoto|

SELECT "purchases".* FROM "purchases" WHERE "purchases"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def more
    @purchase = Purchase.find(params[:id])