app/controllers/purchases_controller.rb

SELECT "purchases".* FROM "purchases" WHERE "purchases"."type_id" = ?  [["type_id", 1]]
---
  def show
    @keys = Key.all
    @keys.each do |key|
      if key.key != @activation

          redirect_to '/admin'


      end
    end
    @nophoto = Nophoto.all

    @nophoto.each do |nophoto|
      @no = nophoto.image
    end
  @type = Type.find(params[:id])
  @purchase = Purchase.where(type_id: params[:id])