app/controllers/sales_controller.rb

  def show
    @keys = Key.all
    @keys.each do |key|
      if key.key != @activation

          redirect_to '/admin'


      end
    end
    @nophoto = Nophoto.all

    @nophoto.each do |nophoto|
      @no = nophoto.image
    end
    @type = Type.find(params[:id])
    @salesauto = Sale.where(type_id: params[:id])
    @saf = @salesauto.where(sales: false)
---
SELECT "nophotos".* FROM "nophotos"
SELECT "sales".* FROM "sales" WHERE "sales"."type_id" = ? AND "sales"."sales" = ?  [["type_id", 1], ["sales", 0]]
SELECT "sales".* FROM "sales" WHERE "sales"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def more
    @keys = Key.all
    @keys.each do |key|
      if key.key != @activation

          redirect_to '/admin'


      end
    end
    @nophoto = Nophoto.all

    @nophoto.each do |nophoto|
      @no = nophoto.image
    end
    @sale = Sale.find(params[:id])
---
SELECT "nophotos".* FROM "nophotos"
SELECT "sales".* FROM "sales" WHERE "sales"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]